package org.example.java29042024;

public class PracticeElseIf {
}

/*
Требуется определить, является ли данный год високосным.
Високосным является год, номер которого кратен четырём, но не кратен 100. При этом годы, кратные четырем, также високосные.
Отсюда следует распределение високосных годов:
год, номер которого кратен 400, — високосный;
остальные годы, номер которых кратен 100, — невисокосные (например, годы 1700, 1800, 1900, 2100, 2200, 2300);
остальные годы, номер которых кратен 4, — високосные;
все остальные годы — невисокосные.


Ладья в шахматах, это фигура, которая может двигаться (и бить) на любое число
полей по горизонтали или по вертикали при условии, что на её пути нет фигур.
Требуется определить, бьет ли ладья, стоящая на клетке с указанными координатами (номер строки и номер столбца),
 фигуру, стоящую на другой указанной клетке (других фигур на доске нет).

Даны три целых числа. Определите, сколько среди них совпадающих.

сделать с использованием switch-case:
Перед сном Алексей решил посчитать овец, чтобы быстрее уснуть.
Помогите Алексею верно закончить фразу «Через забор уже перепрыгнули ...»
одним из возможных продолжений: «n овец», «n овца», «n овцы», правильно склоняя слово «овца».
 */
