package org.example.java29042024;

public class Practice {
}

/*

написать сначала на if-else, затем на switch-case:

Создайте программу, которая получает буквенную оценку
(A, B, C, D, F) и выводит полное описание оценки
(например, A - Отлично, B - Хорошо, и т.д.).

Создайте программу с меню, где каждый пункт соответствует определённой команде
(например, 1 - Открыть файл, 2 - Сохранить файл, 3 - Закрыть программу).
Считайте с клавиатуры команду, отреагируйте соответствующим образом

Создайте программу, которая принимает код валюты (например, USD, EUR, GBP, CNY) и сумму в этой валюте.
Используйте switch-case для выбора соответствующего курса обмена и пересчёта суммы в евро.
Курсы валют можно задать статически в коде программы.

Напишите программу, которая принимает команды управления
персонажем в текстовой игре (up, down, right, left).
Используйте switch-case для обработки команд и
изменения положения персонажа на карте или вывода сообщений о действиях персонажа.
На команду location должны выводиться текущие координаты.
Изначально начинаем в точке с координатами 0,0

тернарный оператор:
На одном из аукционов торгуются два покупателя. Покупатель 1 предложил за очередной лот цену a,
Покупатель 2 цену b. Кто из покупателей выиграет торги?

 */