package org.example.java24042024;

public class Practice {
}

/*
Создайте класс Counter, в main методе которого будут выводиться числа от 1 до 10, затем обратно от 10 до 1.
Используйте переменную count.
Используйте инкремент для первой части и декремент для второй части.









Напишите программу, которая запрашивает у пользователя числа до тех пор,
 пока не будет введено число 0. Подсчитайте, сколько раз было введено каждое из чисел:
  положительное или отрицательное (используйте инкремент для счетчиков).

  Создайте массив из 5 случайных целых чисел.
  Используя цикл, подсчитайте количество чётных и нечётных чисел в массиве,
  используя инкремент для обоих счетчиков. Выведите оба счетчика после окончания цикла.


(a && b) ^ (a || c) = true

(a || b) && (!c) = true

 */