package org.example.java25042024;

public class Practice {
}

/*
написать программу, которая считывает два целых
числа с клавиатуры и выводит на экран сообщение
о том, какое из чисел больше, или сообщает, что они равны.
*/

/*
написать программу, которая проверяет, является ли
введенное пользователем число четным или нечетным,
и выводит соответствующее сообщение.
 */


// если метод возвращает boolean, то он должен называться is... has...
/*
написать метод isAllowed, принимающий на вход рост посетителя аттракциона
и возвращающий true, если ему можно пройти (рост больше 140) или
false, если нельзя
 */

/*
метод, принимающий 3 числа и возвращающий минимальное из них
int minOfThree(int a, int b, int c) {

}
 */

/*
цена после скидки -- метод принимает стоимость товара и возвращает его цену со скидкой.
скидка применяется только на товар дороже 100
 */

/*
минимальное положительное -- принимающий 3 числа и возвращающий минимальное положительное число
 */

/*
каскадный if:
Программа получает количество баллов, набранных студентом за контрольную работу.
В зависимости от количества баллов, студенту ставится оценка по следующей шкале:
От 90 до 100 — отлично
От 75 до 89 — хорошо
От 50 до 74 — удовлетворительно
Меньше 50 — неудовлетворительно
(необязательно: добавить проверку валидности баллов)
 */

/*
Принимаем на вхож температуру воздуха в градусах Цельсия.
Программа должна классифицировать погоду как "холодно" (меньше 0),
 "прохладно" (от 0 до +15), "тепло" (от +16 до +25) и "жарко" (выше +25).
 */

/*
система логина:
создаем логин и пароль пользователя в переменных. запрашиваем у пользователя пароль 3 раза.
После 3й неудачной попытки сообщаем пользователю о блокировке его аккаунта и завершаем работу программы.
 */

